// Завдання 1


/*
  Створіть змінну "num", яка містить число
  
  Напишіть блоки перевірок, порівнюючи значення змінної "num" з числом 10.

  Для кожного блоку перевірки виконайте операцію порівняння, якщо умова виконується успішно — виводиться рядок
  - якщо "num" більше 10 — "значення num більше 10"
  - якщо "num" менше 10 — "значення num менше 10"
  - якщо "num" більше або дорівнює 10 — "значення num більше або дорівнює 10"
  - якщо "num" менше або дорівнює 10 — "значення num менше або дорівнює 10"
  - якщо "num" дорівнює 10 — "значення num дорівнює 10"
  - якщо "num" строго дорівнює 10 — "значення num строго дорівнює 10"
  - якщо "num" не дорівнює 10 — "значення num не дорівнює 10"
  - якщо "num" строго не дорівнює 10 — "значення num строго не дорівнює"
*/

// Рішення:
// let num = 5;

// if (num > 10) {
//   console.log("значення num більше 10");
// } 

// if (num < 10) {
//   console.log("значення num менше 10");
// }

// if (num >= 10) {
//   console.log("значення num більше або дорівнює 10");
// }

// if (num <= 10) {
//   console.log("значення num менше або дорівнює 10");
// }

// if (num == 10) {
//   console.log("значення num дорівнює 10");
// }

// if (num === 10) {
//   console.log("значення num строго дорівнює 10");
// }

// if (num != 10) {
//   console.log("значення num не дорівнює 10");
// }

// if (num !== 10) {
//   console.log("значення num строго не дорівнює 10");
// }




//------------------------------------------------------------------------------------------------------------

// Завдання 2

/*
    Створіть змінну "x", що містить число
    
    Напишіть блок перевірки, чи є значення змінної НЕ числом
    якщо значення змінної НЕ є числом, вивести в консоль — "Значення змінної є НЕ числом"
    В іншому випадку нічого не відбувається  

*/

// Рішення:
// let x = "d";


// if (isNaN(x)){
//   console.log("Значення змінної є НЕ числом; NaN");
// } 
//------------------------------------------------------------------------------------------------------------

// Завдання 3

/*
    Створіть змінну "x", що містить число
    
    Напишіть блок перевірки, чи є значення змінної числом
    якщо значення змінної є числом, вивести в консоль — "Значення змінної є числом"
    В іншому випадку нічого не відбувається  
*/

// // Рішення:
// let x = 5;

// if (!isNaN(x)) {
//   console.log("Значення змінної є числом; not Nan")
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 4

/*
    Створіть змінну "str", 
    
    Напишіть блок перевірки, чи є значення змінної рядком
    якщо значення змінної є рядком, вивести в консоль — "Значення змінної є рядком"
    В іншому випадку нічого не відбувається  
*/

// // Рішення:
// let str = 5;

// if (typeof str == "string") {
//   console.log("Значення змінної type string");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
    Створіть змінну "str", яка зберігає рядок 
    
    Напишіть блок перевірки, чи є рядок порожнім
    якщо змінна-рядок є порожнім рядком, вивести в консоль — "Рядок є порожнім"
    В іншому випадку нічого не відбувається  
*/

// // Рішення:
// let str = ""

// if (str.length == 0) {
//   console.log("Рядок є порожнім");
// }

// let str = ""

// if (str == "") {
//   console.log("Рядок є порожнім");
// }

// let str = ""

// if (str.length) {
//   console.log();
// }

// let str = ""

// if (str) {
//   console.log("Рядок є порожнім");
// }


// let str = ""

// if (!str.length) {
//   console.log("Рядок є порожнім");
// }

// let str = ""

// if (!str) {
//   console.log("Рядок є порожнім");
// }



//------------------------------------------------------------------------------------------------------------

// Завдання 6

/*
    Створіть змінну "age", яка зберігає число — вік користувача
    Створіть змінну "message", яка зберігає рядок — "Buy"

    Напишіть блок перевірки, чи є вік більшим або дорівнює 18
    якщо вік більший або дорівнює 18, присвоїти змінній "message" рядок — "Welcome"
    В іншому випадку нічого не відбувається 

    Виведіть у консоль змінну "message"
*/

// // Рішення:
// let age = 20;
// let message = "bye";

// if (age >= 18){
//   message = "Welcome";
// } 
// console.log(message);




//------------------------------------------------------------------------------------------------------------

// Завдання 7

/*
    Створіть змінну "age", яка зберігає вік користувача
    Створіть змінну "isAge", яка зберігає false

    Напишіть блок перевірки, чи є вік користувача більшим або дорівнює 18
    якщо вік більший або дорівнює 18, присвоїти змінній "isAge" — true
    В іншому випадку нічого не відбувається 

    Виведіть у консоль змінну "isAge"   
*/

// Рішення:
// let age = 20;
// let isAge = false;

// if (age >= 18) {
//   isAge = true;
// }
// console.log(isAge);

//------------------------------------------------------------------------------------------------------------

// Завдання 8

/*
    Створіть змінну "x", що містить число
    
    Напишіть блок перевірки, чи є значення змінної НЕ числом
    якщо значення змінної НЕ є числом, вивести в консоль — "Значення змінної є НЕ числом"
    Інакше вивести в консоль — "Значення змінної є числом"

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.

*/

// Рішення:
// let x = "5";

// if (isNaN(x)) {
//   console.log("Значення змінної є НЕ числом");
// } else {
//   console.log("Значення змінної є числом");
//   console.log(x + x);
//   console.log(x - x);
// }

// let x = "5";
// let num = +x

// if (isNaN(num)) {
//   console.log("Значення змінної є НЕ числом");
// } else {
//   console.log("Значення змінної є числом");
//   console.log(num + num);
//   console.log(num - num);
// }
//------------------------------------------------------------------------------------------------------------

// Задача 9

/*
    Создайте переменную "x", содержащая число
    
    Напишите блок проверки, явл значение переменной число
    если значение переменной число, вывести в консоль - "Значение переменной явл числом"
    Иначе вывести в консоль - "Значение переменной явл НЕ числом"

    *
    *Дополнительно: Реализуйте проверку с помощью тернарного оператора.
*/

// Решение:

// let x = 5;

// if (!isNaN(x)) {
//   console.log("Значення змінної є числом; not NaN");
// } else {
//   console.log("Значення змінної є НЕ числом");
// }

//------------------------------------------------------------------------------------------------------------

// Завдання 10

/*
    Створіть змінну "str", 
    
    Напишіть блок перевірки, чи є значення змінної рядком
    якщо значення змінної є рядком, вивести в консоль — "Значення змінної є рядком"
    Інакше вивести в консоль — "Значення змінної є НЕ рядком"

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:
// let str = "text";
// str = 5;

// if (typeof str == "string") {
//   console.log("Значення змінної є рядком");
// } else {
//   console.log("Значення змінної є НЕ рядком");
// }

//------------------------------------------------------------------------------------------------------------

// Завдання 11

/*
    Створіть змінну "str", яка зберігає рядок 
    
    Напишіть блок перевірки, чи є рядок порожнім
    якщо змінна-рядок є порожнім рядком, вивести в консоль — "Рядок є порожнім"
    Інакше вивести в консоль змінну "str"

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// // Рішення:
// let str = "text";
// if (str === "") {
//   console.log("Рядок є порожнім");
// } else {
//   console.log(str);
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 12

/*
    Створіть змінну "str", яка зберігає рядок 
    
    Напишіть блок перевірки, чи є рядок НЕ порожнім
    якщо змінна-рядок НЕ є порожнім рядком, вивести в консоль рядок "str"
    Інакше вивести в консоль — "Рядок є порожнім"

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:

// let str = "text";
// if (str !== "") {
//   console.log(str);
// } else {
//   console.log("Рядок є порожнім");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 13

/*
    Створіть змінну "age", яка зберігає число — вік користувача
    Створіть змінну "message" без значення 

    Напишіть блок перевірки, чи є вік більшим або дорівнює 18
    якщо вік більший або дорівнює 18, присвоїти змінній "message" рядок — "Welcome"
    Інакше присвоїти змінній "message" рядок — "Buy"

    Виведіть у консоль змінну "message"

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:
// let age = 20;
// let message;

// if (age >= 18) {
//   message = "Welcome";
// } else {
//   message = "Bye"
// }

//------------------------------------------------------------------------------------------------------------

// Завдання 14

/*
    Створіть змінну "age", яка зберігає вік користувача
    Створіть змінну "isAge" без значення 

    Напишіть блок перевірки, чи є вік користувача більшим або дорівнює 18
    якщо вік більший або дорівнює 18, присвоїти змінній "isAge" — true
    Інакше присвоїти змінній "isAge" — false

    Виведіть у консоль змінну "isAge"   

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:
// let age = 19;
// let isAge;

// if (age >= 18) {
//   isAge = true;
// } else {
//   isAge = false;
// }

// console.log(isAge)



//------------------------------------------------------------------------------------------------------------

// Завдання 15

/*
    Створіть змінну "age", яка зберігає вік користувача
    Створіть змінну "isAge" без значення 

    Напишіть блок перевірки, чи є вік користувача більшим або дорівнює 18
    якщо вік більший або дорівнює 18, присвоїти змінній "isAge" — true
    Інакше присвоїти змінній "isAge" — false

    Створіть змінну "message" без значення 

    Напишіть блок перевірки, чи є вік більший або дорівнює 18 
    якщо вік більший або дорівнює 18 ("isAge" дорівнює true), присвоїти змінній "message" рядок — "Welcome"
    Інакше присвоїти змінній "message" рядок — "Buy"

    Виведіть у консоль змінну "message"    

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:
// let age = 19;
// let isAge;

// if (age >= 18) {
//   isAge = true;
// } else {
//   isAge = false;
// }

// let message;

// if (isAge) {
//   message = "Welcome";
// } else {
//   message = "Bye";
// }

// console.log(message);
// console.log(isAge);


// let age = 19;
// let isAge = age >= 18;

// // if (age >= 18) {
// //   isAge = true;
// // } else {
// //   isAge = false;
// // }

// let message = isAge ? "Welcome?" : "bye"

// // if (isAge) {
//   // message = "Welcome";
// // } else {
// //   message = "Bye";
// // }

// console.log(message);
// console.log(isAge);



//------------------------------------------------------------------------------------------------------------

// Завдання 16

/*
    Створіть змінну "num", запросіть у користувача введення числа від 0 до 10
    
    Напишіть блок перевірки, чи є значення більшим за 10
    якщо значення змінної "num" більше 10, додайте до змінної число 10
    Інакше значення змінної "num" поділіть на 2

    Виведіть у консоль змінну "num"

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// // Рішення:
// let num = prompt("Введіть число від 0 до 10:");

// if (num > 10) {
//     num = num + 10; 
// } else {
//     num = num / 2; 
// }

// console.log(num);



//------------------------------------------------------------------------------------------------------------

// Завдання 17

/*
    Створіть змінну "total", яка зберігає число, що представляє вартість товарів.
    Створіть змінну "discount", яка зберігає число, що представляє знижку (початкове значення 0).

    Напишіть блок перевірки:
    - якщо загальна вартість товарів більша або дорівнює 1000, присвойте змінній "discount" значення 0.05 (5% знижка)
    - інакше присвойте змінній "discount" значення 0.01 (1% знижка)

    Створіть змінну "totalPrice", яка зберігає обчислену загальну суму товарів з урахуванням знижки.
    Виведіть у консоль вартість товарів, знижку у відсотках та числовому вираженні, а також загальну суму з урахуванням знижки.

    Приклад:
    Сума товарів 1000, знижка - 5% - 50 грн, загальна сума з урахуванням знижки 950 грн.
    Сума товарів 100, знижка - 1% - 1 грн, загальна сума з урахуванням знижки 99 грн.

    *
    *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:


//------------------------------------------------------------------------------------------------------------

// Завдання 18

/*
  Створіть змінну "role" та запросіть у користувача введення ролі (admin або user).
  Створіть змінну "message" зі значенням "Welcome"

  Напишіть блок перевірки:
    якщо змінна "role" дорівнює "admin", додайте до змінної "message" рядок "Admin".
    Інакше додайте до змінної "message" рядок "User".

  Виведіть змінну "message" у консоль.

  *
  *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:


//------------------------------------------------------------------------------------------------------------

// Завдання 19

/*
  Створіть змінну "x", яка зберігає число.
  Напишіть блок перевірок, який перевіряє, чи є число парним:
  - якщо число парне, виведіть у консоль "Число є парним".
  - інакше виведіть у консоль "Число є непарним".
*/

// Рішення:
// let x = 4;

// if (x % 2 == 1) {
//     console.log("odd");
// } else {
//     console.log("even");
// }

//------------------------------------------------------------------------------------------------------------

// Завдання 20

/*
  Створіть змінну "x", яка зберігає число.
  Напишіть блок перевірок, який перевіряє, чи є число непарним:
  - якщо число парне, виведіть у консоль "Число є непарним".
  - інакше виведіть у консоль "Число є парним".
*/

// Рішення:
// let x = 4;

// if (x % 2 == 0) {
//   console.log("even");
// } else {
//   console.log("odd");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 21

/*
  Створіть змінну "str", яка зберігає рядок.

  Напишіть блок перевірки, чи є довжина рядка більшою або дорівнює 5 символам:
  - якщо довжина рядка більша або дорівнює 5 символам, виведіть повідомлення "Рядок більший або дорівнює 5 символам".
  - інакше виведіть у консоль "Рядок менший за 5 символів".
*/

// Рішення:
// let str = "text";

// if (str.length >= 5) {
//   console.log("Рядок більший або дорівнює 5 символам");
// } else {
//   console.log("Рядок менший за 5 символів");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 22

/*
  Створіть змінну "role", яка може зберігати рядок "admin", "vip" або "user".
  Напишіть блоки перевірок, які порівнюють значення змінної "role" та виводять відповідне повідомлення у консоль:
  - якщо значення "role" дорівнює "admin", виведіть "Welcome Admin".
  - якщо значення "role" дорівнює "vip", виведіть "Welcome VIP".
  - якщо значення "role" дорівнює "user", виведіть "Welcome User".
  - В іншому випадку виведіть "Invalid role".

  Таким чином, залежно від значення змінної "role" буде виводитися відповідне привітання у консоль.
*/

// Рішення:
// let role = "y";

// if (role === "admin") {
//   console.log("Welcome, admin");
// } else if (role === "VIP") {
//   console.log("Welcome, VIP");
// } else if (role === "user") {
//   console.log("Welcome, user");
// } else {
//   console.log("Invalid role");
// }



//------------------------------------------------------------------------------------------------------------

// Завдання 23

/*
  Створення калькулятора

  Створіть змінні "x" та "y", які зберігають числа.
  Створіть змінну "operation", яка зберігає рядок, що представляє одну з чотирьох арифметичних операцій: 
    - додавання (+), 
    - віднімання (-),
    - множення (*) 
    - ділення (/).

  Створіть змінну "res" без значення.

  Напишіть блоки перевірок, які виконують арифметичну операцію залежно від значення змінної "operation" та зберігають результат у змінну "res":
  - якщо операція додавання (+), присвойте змінній "res" суму чисел.
  - якщо операція віднімання (-), присвойте змінній "res" різницю чисел.
  - якщо операція множення (*), присвойте змінній "res" добуток чисел.
  - якщо операція ділення (/), присвойте змінній "res" результат ділення чисел.
  - Інакше, якщо операція не відповідає жодній з вказаних, виведіть у консоль повідомлення про те, що дана арифметична операція відсутня, 
    та присвойте змінній "res" значення 0.

  Таким чином, залежно від операції буде виконана відповідна арифметична операція, і результат буде записаний у змінну "res".
*/

// Рішення:

// let x = 10;
// let y = 5;
// let operation = "+"; 

// let res;

// if (operation === "+") {
//   res = x + y;
// } else if (operation === "-") {
//   res = x - y;
// } else if (operation === "*") {
//   res = x * y;
// } else if (operation === "/") {
//   res = x / y;
// } else {
//   console.log("дана арифметична операція відсутня");
//   res = 0;
// }

// console.log(res);


//------------------------------------------------------------------------------------------------------------

// Завдання 24

/*
  Створіть змінну "str" без значення.
  Створіть змінну "result", яка зберігає порожній рядок.
  Створіть змінну "command", яка зберігає число 1, 2, 3, 4 або 5.

  Напишіть блоки перевірок, які присвоюють значення змінній "result" на основі команди:
  - якщо змінна "command" дорівнює 1, присвойте змінній "result" вихідний рядок у нижньому регістрі.
  - якщо змінна "command" дорівнює 2, присвойте змінній "result" вихідний рядок у верхньому регістрі.
  - якщо змінна "command" дорівнює 3, присвойте змінній "result" перший символ вихідного рядка.
  - якщо змінна "command" дорівнює 4, присвойте змінній "result" останній символ вихідного рядка.
  - якщо змінна "command" дорівнює 5, присвойте змінній "result" символи, крім першого та останнього символів вихідного рядка.
  - інакше виведіть повідомлення "Неприпустима команда".

  Виведіть у консоль значення змінної "result".
*/

// // Рішення:
// let str;
// str = "text";

// let result = "";
// let command = 2;

// if (command === 1) {
//   result = str.toLowerCase();
// } else if (command === 2) {
//   result = str.toUpperCase();
// } else if (command === 3) {
//   result = str[0];
// } else if (command === 4) {
//   result = str[str.length - 1];
// } else if (command === 5) {
//   result = str.slice(1, -1);
// } else {
//   console.log("Неприпустима команда");
// }

// console.log(result);

//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------

// Логічні оператори

//------------------------------------------------------------------------------------------------------------

// Завдання 25
/*
  Створіть змінну "age", яка зберігає вік.
  Створіть змінну "isAge" без значення.

  Присвойте змінній "isAge" результат порівняння: чи є вік користувача більшим або дорівнює 18 та меншим або дорівнює 27.
  Таким чином, значення змінної "isAge" буде true, якщо вік відповідає зазначеним умовам, і false, якщо не відповідає.
*/

// Рішення:
// let age = 20;
// let isAge = age >= 18 && age <= 27
// console.log(isAge);

// let age = 20;
// let isAge = age >= 18 && age <= 27 ? true : false 
// console.log(isAge);




//------------------------------------------------------------------------------------------------------------

// Завдання 26

/*
  Створіть змінну "num", запросивши у користувача число від 0 до 100.
  Створіть змінну "isRange" без значення.

  Присвойте змінній "isRange" результат порівняння: чи входить число у діапазон від 0 до 100 включно.
  Таким чином, значення змінної "isRange" буде true, якщо введене число входить у діапазон від 0 до 100, і false, якщо виходить за межі діапазону.

  Додатково:
  - Реалізуйте код з використанням блоків перевірок (умовних гілок).
  - Реалізуйте код з використанням тернарного оператора.
*/

// // Рішення:
// let num = Number(prompt("Введіть число від 0 до 100"));

// let isRange = (num >= 0 && num <= 100) ? true : false;

// console.log(isRange);



//------------------------------------------------------------------------------------------------------------

// Завдання 27

/*
  Створіть змінну "x" з довільним значенням.
  Виконайте блок перевірок:
  - Якщо значення змінної відноситься до типу даних number, виведіть його у консоль.
  - Інакше, якщо значення змінної не є типом даних number, виведіть у консоль — "Значення змінної не є типом даних number".
*/

// Рішення:
// let x = 4;

// if (typeof x === "number") {
//   console.log(x);
// } else {
//   console.log("Значення змінної не є типом даних number");
// }



//------------------------------------------------------------------------------------------------------------

// Завдання 28
/*
  Створіть змінну "str", яка зберігає рядок.
  Виконайте блок перевірки, який перевіряє, чи є рядок порожнім, без використання операції порівняння.
  Якщо рядок порожній, виведіть повідомлення — "Рядок є порожнім".
  Інакше виведіть рядок у консоль.

  *
  *Додатково: Реалізуйте перевірку за допомогою тернарного оператора.
*/

// Рішення:
// let str = "";

// if (!str) {
//   console.log("Рядок є порожнім");
// } else {
//   console.log(str);
// }



//------------------------------------------------------------------------------------------------------------

// Завдання 29

/*
  Створіть змінну "role", яка може зберігати роль "admin", "vip" або "user".
  Виконайте блок перевірок і виведіть у консоль відповідне повідомлення:
  - Якщо значення змінної role дорівнює "admin" або "vip", виведіть "Welcome administrator".
  - Інакше виведіть у консоль "Welcome user".
*/

// Рішення:
// let role = "admin";

// if (role === "admin" || role === "vip") {
//   console.log("Welcome administrator");
// } else {
//   console.log("Welcome user");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 30

/*
  Створіть змінну "num", яка зберігає число.

  Напишіть блоки перевірок, які виводять повідомлення, у який діапазон потрапляє значення:
  - якщо значення "num" потрапляє від 0 включно до 10, виведіть у консоль: "Значення потрапляє у діапазон від 0 до 10".
  - якщо значення "num" потрапляє від 10 включно до 20, виведіть у консоль: "Значення потрапляє у діапазон від 10 до 20".
  - якщо значення "num" потрапляє від 20 включно до 50, виведіть у консоль: "Значення потрапляє у діапазон від 20 до 50".
  - якщо значення "num" потрапляє від 50 включно до 100, виведіть у консоль: "Значення потрапляє у діапазон від 50 до 100".
  - якщо значення "num" дорівнює 100 або більше, виведіть у консоль: "Значення потрапляє у діапазон від 100 і більше".
  - інакше, якщо введене некоректне значення, виведіть у консоль: "Неприпустима операція".
*/

// Рішення:
// let num = "f";
// if (num >= 0 && num < 10){
//   console.log("Значення потрапляє у діапазон від 0 до 10");
// } else if (num >= 10 && num < 20) {
//   console.log("Значення потрапляє у діапазон від 10 до 20");
// } else if (num >= 20 && num < 50) {
//   console.log("Значення потрапляє у діапазон від 20 до 50");
// } else if (num >= 50 && num < 100) {
//   console.log("Значення потрапляє у діапазон від 50 до 100");
// } else if (num > 100) {
//   console.log("Значення потрапляє у діапазон від 100 і більше");
// } else {
//   console.log("Неприпустима операція");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 31

/*
    Створіть змінну "x" з довільним значенням 

    Напишіть блоки перевірок, які виводять повідомлення, до якого типу даних належить значення змінної:
    - якщо значення є типом даних number, виведіть у консоль — "Значення належить до типу даних number"
    - якщо значення є типом даних string, виведіть у консоль — "Значення належить до типу даних string"
    - якщо значення є типом даних boolean, виведіть у консоль — "Значення належить до типу даних boolean"
    - якщо значення є null, виведіть у консоль — "Значення належить до типу даних null"
    - якщо значення є undefined, виведіть у консоль — "Значення належить до типу даних undefined"
    - якщо значення є об'єктом, виведіть у консоль — "Значення належить до типу даних object"
    - якщо значення є масивом, виведіть у консоль — "Значення належить до типу даних array"
*/

// Рішення:
// Змінна з довільним значенням
// let x = "";

// if (typeof x === "number") {
//   console.log("Значення належить до типу даних number");
// } else if (typeof x === "string") {
//   console.log("Значення належить до типу даних string");
// } else if (typeof x === "boolean") {
//   console.log("Значення належить до типу даних boolean");
// } else if (x === null) {
//   console.log("Значення належить до типу даних null");
// } else if (typeof x === "undefined") {
//   console.log("Значення належить до типу даних undefined");
// } else if (Array.isArray(x)) {
//   console.log("Значення належить до типу даних array");
// } else if (typeof x === "object") {
//   console.log("Значення належить до типу даних object");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 32

/*
  Створіть змінну "total", яка зберігає суму товарів.
  Створіть змінну "discount" для знижки з початковим значенням 0.

  Виконайте блок перевірок і виведіть результати відповідно до умов:
  - якщо сума у діапазоні від 0 до 1000, discount присвоїти 0%.
  - якщо сума у діапазоні від 1000 до 10000, discount присвоїти 5%.
  - якщо сума у діапазоні від 10000 до 50000, discount присвоїти 10%.
  - якщо сума більше або дорівнює 50000, discount присвоїти 15%.

  Підказка:
  100% - 1
  50% - 0.5
  10% - 0.1
  1% - 0.01
  0% - 0

  Створіть змінну "totalPrice", яка буде зберігати загальну суму з урахуванням знижки.
  Виведіть у консоль інформативно результати.

  Приклад:
  Сума товарів: 1000, знижка: 5% - 50, загальна сума з урахуванням знижки: 950
*/

// Рішення:
// let total = 1000;

// let discount = 0;

// if (total >= 0 && total < 1000) {
//   discount = 0;
// } else if (total >= 1000 && total < 10000) {
//   discount = 0.05;
// } else if (total >= 10000 && total < 50000) {
//   discount = 0.1;
// } else if (total >= 50000) {
//   discount = 0.15;
// }

// let discountAmount = total * discount;

// let totalPrice = total - discountAmount;

// console.log(
//   `Сума товарів: ${total}, ` + `знижка: ${discount * 100}% - ${discountAmount}, ` + `загальна сума з урахуванням знижки: ${totalPrice}`);

//------------------------------------------------------------------------------------------------------------

// Завдання 33

/*
  Створіть змінну "discountName" — назва знижки ("BASE", "BRONZE", "SILVER", "GOLD", "PLATINUM")
  Створіть змінну "total", яка зберігає суму товарів.
  Створіть змінну "discount" для знижки з початковим значенням 0.

  Виконайте блок перевірок і виведіть результати відповідно до умов:
  - якщо назва знижки "discountName" — "BASE", присвойте discount значення 0%.
  - якщо назва знижки "discountName" — "BRONZE", присвойте discount значення 5%.
  - якщо назва знижки "discountName" — "SILVER", присвойте discount значення 10%.
  - якщо назва знижки "discountName" — "GOLD", присвойте discount значення 15%.
  - Інакше виведіть у консоль повідомлення про те, що назва знижки неприпустима і знижка за замовчуванням складає 0%.

  Підказка:
  100% - 1
  50% - 0.5
  10% - 0.1
  1% - 0.01
  0% - 0

  Створіть змінну "totalPrice", яка буде зберігати загальну суму з урахуванням знижки.
  Виведіть у консоль інформативно результати.

  Приклад:
  Сума товарів: 1000$, знижка: 5% - 50$, загальна сума з урахуванням знижки: 950$
*/

// Рішення:
// let discountName = "BRONZE"; // BASE, BRONZE, SILVER, GOLD, PLATINUM

// let total = 1000;

// let discount = 0;

// if (discountName === "BASE") {
//   discount = 0;
// } else if (discountName === "BRONZE") {
//   discount = 0.05;
// } else if (discountName === "SILVER") {
//   discount = 0.1;
// } else if (discountName === "GOLD") {
//   discount = 0.15;
// } else {
//   console.log("Неприпустима назва знижки. Знижка за замовчуванням складає 0%");
//   discount = 0;
// }

// let discountAmount = total * discount;

// let totalPrice = total - discountAmount;

// console.log(
//   `Сума товарів: ${total}$, ` + `знижка: ${discount * 100}% - ${discountAmount}$, ` + `загальна сума з урахуванням знижки: ${totalPrice}$`);

//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------
