//------------------------------------------------------------------------------------------------------------

// switch...case

//------------------------------------------------------------------------------------------------------------

// Завдання 1

/*
    Створіть змінну "role", яка зберігає рядок - "admin", "vip", "user".

    Напишіть код без використання блоків перевірок, який виконує такі дії:
    - якщо значення змінної "role" - "admin", виведіть у консоль "Welcome admin".
    - якщо значення змінної "role" - "vip", виведіть у консоль "Welcome vip".
    - якщо значення змінної "role" - "user", виведіть у консоль "Welcome user".
    - Якщо не було збігів, виведіть у консоль "Неприпустима роль".
*/

// // Рішення:
// let role = "admin";

// switch (role) {
//   case "admin":
//     console.log("Welcome admin");
//     break;
//   case "vip":
//     console.log("Welcome VIP");
//     break;
//   case "user":
//     console.log("Welcome, user");
//     break;
//   default:
//     console.log("Unknown role")
//     break;
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 2

/*
  Створення калькулятора

  Створіть змінні "x" і "y", які зберігають числа.
  Створіть змінну "operation", яка зберігає рядок, що представляє одну з чотирьох арифметичних операцій: 
    - додавання (+), 
    - віднімання (-),
    - множення (*) 
    - ділення (/).

  Створіть змінну "result" без значення.

  Напишіть код без використання блоків перевірок, який виконує арифметичні операції залежно від значення змінної "operation" та зберігає результат у змінну "result".
*/

// Рішення:
// let x = 4;
// let y = 6;
// let operation = "^";
// let result;
// let isCorrect = true;

// switch (operation) {
//   case "+":
//     result = x + y;
//     break;
//   case "-":
//     result = x - y;
//     break;
//   case "*":
//     result = x * y;
//     break;
//   case "/":
//     result = x / y;
//     break;
//   default:
//     // console.log("Invalid operation");
//     isCorrect = false;
//     break;
// }

// if (isCorrect){
//   console.log(result);
// } else {
//   console.log("Invalid operation");
// }


//------------------------------------------------------------------------------------------------------------

// Завдання 3

/*
  Створіть змінну "str" без значення.
  Створіть змінну "result", яка зберігає порожній рядок.
  Створіть змінну "command", яка зберігає число 1, 2, 3, 4 або 5.

  Напишіть код без використання блоків перевірок, який присвоює значення змінній "result" на основі команди.
  Виведіть у консоль значення змінної "result".
*/

// // Рішення:
// let str;
// let result = "";
// let command = 3;

// switch (3) {
  
  
//   default:
//     result = command
// }
// console.log(result);

//------------------------------------------------------------------------------------------------------------

// Завдання 4

/*
  Створіть змінну "fruit", яка зберігає назву фрукта - "apple", "banana", "orange".
  Напишіть код без використання блоків перевірок, який виводить ціну фрукта за одиницю:
  - Якщо змінна "fruit" - "apple", виведіть у консоль "Ціна "apple" за одиницю 5$".
  - Якщо змінна "fruit" - "banana", виведіть у консоль "Ціна "banana" за одиницю 7$".
  - Якщо змінна "fruit" - "orange", виведіть у консоль "Ціна "orange" за одиницю 9$".
  - Інакше, якщо фрукт відсутній, виведіть повідомлення "Передано неприпустиме значення".
*/

// Рішення:
let fruit = "apple";




//------------------------------------------------------------------------------------------------------------

// Завдання 5

/*
Створіть змінну "role", яка зберігає рядок - "admin", "vip", "user".

Напишіть код без використання блоків перевірок, який виконує такі дії:
- якщо значення змінної "role" - "admin" або "vip", виведіть у консоль "Welcome administrator".
- якщо значення змінної "role" - "user", виведіть у консоль "Welcome user".
- Якщо не було збігів, виведіть у консоль "Неприпустима роль".
// */

// // Рішення:
// let role = "admin";

// switch (role) {
//   case "admin":
//   case "vip":
//     console.log("Welcome, administrator");
//     break;
//   case "user":
//     console.log("Welcome, user");
//     break;
//   default:
//     console.log("Unknown role")
//     break;
// }

// let role = "ff";
// let message = "Welcome, "

// switch (role) {
//   case "admin":
//   case "vip":
//     message += "administrator";
//     break;
//   case "user":
//     message += "user";
//     break;
//   default:
//     console.log("Unknown role");
//     message = null;
//     break;
// }

// if (message != null){
//   console.log(message); 
// }
//------------------------------------------------------------------------------------------------------------
